In [34]:
import pandas as pd
import numpy as np
import pymongo
import json
import os
import pickle
import sys

In [16]:
# import the connecting credentials 
sys.path.append('../')
from secret import credentials
sys.path.remove('../')

In [17]:
## mongo API connection
sec = credentials()
mongo_uri = sec.connect_string

myclient = pymongo.MongoClient(mongo_uri)

In [18]:
print(myclient.list_database_names())

['bookdb', 'admin', 'local']

In [20]:
mydb = myclient['bookdb']
col_users = mydb['users']

In [21]:
# Query the data (this example retrieves all documents in the collection)
data = list(col_users.find({}))
# Convert the data to a Pandas DataFrame
users = pd.DataFrame(data)

In [22]:
users.drop('_id', axis=1, inplace= True)

In [24]:
users.rename(columns={
    'User-ID':'user_id'
}, inplace=True)

In [25]:
users.head()

,user_id,Location,country,city,Age
0,1.0,"nyc, new york, usa",usa,nyc,NaN
1,2.0,"stockton, california, usa",usa,stockton,18.0
2,3.0,"moscow, yukon territory, russia",russia,moscow,NaN
3,4.0,"porto, v.n.gaia, portugal",portugal,porto,17.0
4,5.0,"farnborough, hants, united kingdom",united kingdom,farnborough,NaN

In [26]:
ratings = pd.read_csv('../py_objects/final_rating.csv', index_col=0).reset_index().drop(columns=['index'])
ratings

,title,num_of_rating,user_id,ISBN,rating,author,year,Publisher,Image_URL
0,10 Lb. Penalty,35,39281,0515123471,0,Dick Francis,1998,Jove Books,http://images.amazon.com/images/P/0515123471.0...
1,10 Lb. Penalty,35,49109,0515123471,5,Dick Francis,1998,Jove Books,http://images.amazon.com/images/P/0515123471.0...
2,10 Lb. Penalty,35,69405,0515123471,0,Dick Francis,1998,Jove Books,http://images.amazon.com/images/P/0515123471.0...
3,10 Lb. Penalty,35,76352,0515123471,0,Dick Francis,1998,Jove Books,http://images.amazon.com/images/P/0515123471.0...
4,10 Lb. Penalty,35,83287,0515123471,10,Dick Francis,1998,Jove Books,http://images.amazon.com/images/P/0515123471.0...
...,...,...,...,...,...,...,...,...,...
93853,"\O\"" Is for Outlaw""",105,234359,0805059555,0,Sue Grafton,1999,Henry Holt &amp; Company,http://images.amazon.com/images/P/0805059555.0...
93854,"\O\"" Is for Outlaw""",105,234623,0805059555,0,Sue Grafton,1999,Henry Holt &amp; Company,http://images.amazon.com/images/P/0805059555.0...
93855,"\O\"" Is for Outlaw""",105,236283,0805059555,10,Sue Grafton,1999,Henry Holt &amp; Company,http://images.amazon.com/images/P/0805059555.0...
93856,"\O\"" Is for Outlaw""",105,238120,0805059555,0,Sue Grafton,1999,Henry Holt &amp; Company,http://images.amazon.com/images/P/0805059555.0...
93857,"\O\"" Is for Outlaw""",105,254899,0805059555,0,Sue Grafton,1999,Henry Holt &amp; Company,http://images.amazon.com/images/P/0805059555.0...

In [27]:
user_merge_ratings = users.merge(ratings, on = "user_id")
user_merge_ratings.head()

,user_id,Location,country,city,Age,title,num_of_rating,ISBN,rating,author,year,Publisher,Image_URL
0,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,1984,76,0451524934,9,George Orwell,1990,Signet Book,http://images.amazon.com/images/P/0451524934.0...
1,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,A Bend in the Road,115,0446527785,0,Nicholas Sparks,2001,Warner Books,http://images.amazon.com/images/P/0446527785.0...
2,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,ANGELA'S ASHES,81,0684874350,0,Frank McCourt,1996,Scribner,http://images.amazon.com/images/P/0684874350.0...
3,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,American Gods,94,0380789035,10,Neil Gaiman,2002,HarperTorch,http://images.amazon.com/images/P/0380789035.0...
4,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,Angela's Ashes (MMP) : A Memoir,92,0684872153,0,Frank McCourt,1999,Scribner,http://images.amazon.com/images/P/0684872153.0...

In [73]:
def clean_us(country):
    if country == 'us':
        return 'usa'
    else:
        return country

In [74]:
user_merge_ratings['country'] = user_merge_ratings['country'].apply(clean_us)

In [75]:
user_merge_ratings.head()

,user_id,Location,country,city,Age,title,num_of_rating,ISBN,rating,author,year,Publisher,Image_URL
0,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,1984,76,0451524934,9,George Orwell,1990,Signet Book,http://images.amazon.com/images/P/0451524934.0...
1,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,A Bend in the Road,115,0446527785,0,Nicholas Sparks,2001,Warner Books,http://images.amazon.com/images/P/0446527785.0...
2,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,ANGELA'S ASHES,81,0684874350,0,Frank McCourt,1996,Scribner,http://images.amazon.com/images/P/0684874350.0...
3,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,American Gods,94,0380789035,10,Neil Gaiman,2002,HarperTorch,http://images.amazon.com/images/P/0380789035.0...
4,254.0,"minneapolis, minnesota, usa",usa,minneapolis,24.0,Angela's Ashes (MMP) : A Memoir,92,0684872153,0,Frank McCourt,1999,Scribner,http://images.amazon.com/images/P/0684872153.0...

In [6]:
# user_merge_ratings = user_merge_ratings[user_merge_ratings['num_of_rating'] >= 50]

In [77]:
user_merge_ratings.groupby(['country'])['num_of_rating'].sum().sort_values(ascending=False)

country
usa                   6083221
canada                 606807
united kingdom         153930
australia               82995
n/a                     81756
portugal                59694
                        50467
malaysia                34199
new zealand             33742
germany                 27163
spain                   24716
netherlands             19954
iran                    13122
france                  11476
italy                    9191
china                    8848
romania                  8101
brazil                   7609
belgium                  4936
switzerland              4811
qatar                    4328
dominican republic       3982
finland                  2100
austria                  2092
japan                    1951
sweden                   1555
denmark                   448
Name: num_of_rating, dtype: int64

In [78]:
region_unique = user_merge_ratings['country'].unique().tolist()

In [79]:
region_unique.remove('')
region_unique.remove('n/a')

In [81]:
region_unique

['usa',
 'united kingdom',
 'canada',
 'spain',
 'romania',
 'portugal',
 'new zealand',
 'australia',
 'malaysia',
 'netherlands',
 'germany',
 'switzerland',
 'france',
 'italy',
 'belgium',
 'dominican republic',
 'austria',
 'china',
 'qatar',
 'finland',
 'japan',
 'sweden',
 'iran',
 'denmark',
 'brazil']

In [82]:
with open('../py_objects/region_unique.pkl', 'wb') as file:
    pickle.dump(region_unique, file)

In [84]:
# store the saved dataframe
user_merge_ratings.to_csv('../data/final_merge_table.csv', index=False)

In [ ]:
#########################

In [86]:
book_rating_counts_us = user_merge_ratings['ISBN'].value_counts().reset_index()

In [90]:
book_rating_counts_us.columns = ['ISBN', 'Rating-Count']

In [91]:
book_rating_counts_us

            ISBN  Rating-Count
0     0971880107           363
1     0316666343           270
2     0060928336           220
3     0440214041           218
4     0385504209           215
...          ...           ...
4331  0553115715             1
4332  0385427107             1
4333  8401422345             1
4334  0450524604             1
4335  0739407090             1

[4336 rows x 2 columns]

In [93]:
# Merge this filtered dataset with the original ratings and then with the books dataset
ratings_books_50plus_us = pd.merge(book_rating_counts_us, user_merge_ratings, on="ISBN")

In [94]:
ratings_books_50plus_us

,ISBN,Rating-Count,user_id,Location,country,city,Age,title,num_of_rating,rating,author,year,Publisher,Image_URL
0,0971880107,363,194669.0,"savannah, georgia, usa",usa,savannah,46.0,Wild Animus,363,0,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...
1,0971880107,363,2766.0,"frisco, texas, usa",usa,frisco,42.0,Wild Animus,363,6,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...
2,0971880107,363,2977.0,"richland, washington, usa",usa,richland,25.0,Wild Animus,363,0,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...
3,0971880107,363,3363.0,"knoxville, tennessee, usa",usa,knoxville,29.0,Wild Animus,363,0,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...
4,0971880107,363,196047.0,"macomb, michigan, usa",usa,macomb,55.0,Wild Animus,363,0,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
93853,0553115715,1,59172.0,"owen sound, ontario, canada",canada,owen sound,36.0,Bittersweet,62,0,Janis Flores,1978,Bantam Books,http://images.amazon.com/images/P/0553115715.0...
93854,0385427107,1,212898.0,"la ronge, saskatchewan, canada",canada,la ronge,NaN,The Hot Zone,97,0,Richard Preston,1995,Doubleday Books,http://images.amazon.com/images/P/0385427107.0...
93855,8401422345,1,3757.0,"madrid, madrid, spain",spain,madrid,NaN,Fahrenheit 451,119,0,Ray Bradbury,1994,Aims Intl Books Corp,http://images.amazon.com/images/P/8401422345.0...
93856,0450524604,1,212898.0,"la ronge, saskatchewan, canada",canada,la ronge,NaN,Rain,34,0,Stephen Gallagher,1990,Hodder &amp; Stoughton General Division,http://images.amazon.com/images/P/0450524604.0...
93857,0739407090,1,191187.0,"cedar rapids, iowa, usa",usa,cedar rapids,NaN,Where You Belong,31,0,Barbara Taylor Bradford,1999,Doubleday,http://images.amazon.com/images/P/0739407090.0...

In [97]:
top_rated_books_50plus_us = ratings_books_50plus_us.groupby('title')['rating'].mean().reset_index()

In [98]:
top_rated_books_50plus_us

                                                  title    rating
0                                        10 Lb. Penalty  1.906250
1                                    16 Lighthouse Road  1.131579
2                                                  1984  3.486111
3                                   1st to Die: A Novel  2.437908
4                                     2010: Odyssey Two  1.456522
...                                                 ...       ...
1647                                    Year of Wonders  3.220339
1648                                   You Belong To Me  1.517857
1649  Zen and the Art of Motorcycle Maintenance: An ...  1.919355
1650                                               Zoya  1.103448
1651                                \O\" Is for Outlaw"  1.969388

[1652 rows x 2 columns]

In [101]:
top_rated_books_50plus_us =top_rated_books_50plus_us.sort_values('rating', ascending=False).head(5)

                                                  title    rating
1177                                 The Cat in the Hat  5.129032
1337                                  The Little Prince  5.115385
1293                                         The Hobbit  4.892857
532      Harry Potter and the Sorcerer's Stone (Book 1)  4.723684
531   Harry Potter and the Prisoner of Azkaban (Book 3)  4.586466